//Домашнее задание:
//Вычислить значение формулы (a*b)/(c+d), где a, b, c, d - некоторые целые числа. Результат вывести на экран.

int a = 3;
int b = 8;
int c = 2;
int d = 6;
double result = (a*b)/(c+d);
Console.WriteLine(result);